package kr.or.ddit.basic;

import java.util.ArrayList;
import java.util.Collections;
import java.util.HashMap;
import java.util.List;
import java.util.Scanner;

/*
 	문제) 호텔 객실을 관리하는 프로그램을 작성하시오. ( 클래스명 : HotelTest )

   조건1)  호텔 객식을 나타내는 Room클래스는 방번호(int), 방종류, 투숙객이름 필드로 구성되어 있고              
           방번호와 방종류는 다음과 같다.
           - 201~209 : 싱글룸
           - 301~309 : 더블룸
           - 401~409 : 스위트룸

   조건2) 전체 객실 관리는 Map을 이용한다.
          (Map의 key값은 방번호로 하고 value값은 Room의 인스턴스로 한다.)
          생성자에서는 방번호와 방종류를 초기화한다.




실행예시)

*********************************************
       호텔문을 열었습니다. 어서오십시요.
*********************************************


-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   1     <--- 입력

----------------------------------------------
   체크인 작업
----------------------------------------------
 * 201~209 : 싱글룸
 * 301~309 : 더블룸
 * 401~409 : 스위트룸
----------------------------------------------
방 번호 입력 >> 101     <--- 입력
101호 객실은 존재하지 않습니다.

-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   1     <--- 입력

----------------------------------------------
   체크인 작업
----------------------------------------------
 * 201~209 : 싱글룸
 * 301~309 : 더블룸
 * 401~409 : 스위트룸
----------------------------------------------
방 번호 입력 >> 201     <--- 입력
누구를 체크인 하시겠습니까?
이름 입력 >> 홍길동
체크인이 완료되었습니다.

-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   1     <--- 입력

----------------------------------------------
   체크인 작업
----------------------------------------------
 * 201~209 : 싱글룸
 * 301~309 : 더블룸
 * 401~409 : 스위트룸
----------------------------------------------
방 번호 입력 >> 201     <--- 입력
201호 객실은 이미 손님이 있습니다.

-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   3     <--- 입력

----------------------------------------------
      현재 객실 상태
----------------------------------------------
방 번호    방 종류    투숙객 이름
----------------------------------------------
201    싱글룸    홍길동   
202    싱글룸      -   
203    싱글룸      -   
204    싱글룸      -   
205    싱글룸      -   
206    싱글룸      -   
207    싱글룸      -   
208    싱글룸      -   
209    싱글룸      -   
301    더블룸      -   
302    더블룸      -   
303    더블룸      -   
304    더블룸      -   
305    더블룸      -   
306    더블룸      -   
307    더블룸      -   
308    더블룸      -   
309    더블룸      -   
401   스위트룸     -   
402   스위트룸     -   
403   스위트룸     -   
404   스위트룸     -   
405   스위트룸     -   
406   스위트룸     -   
407   스위트룸     -   
408   스위트룸     -   
409   스위트룸     -   
----------------------------------------------

-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   2    <--- 입력

----------------------------------------------
   체크아웃 작업
----------------------------------------------
체크아웃 할 방 번호를 입력하세요.
방번호 입력 >> 101    <--- 입력
101호 객실은 존재하지 않습니다.

-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   2    <--- 입력

----------------------------------------------
   체크아웃 작업
----------------------------------------------
체크아웃 할 방 번호를 입력하세요.
방번호 입력 >> 303    <--- 입력
303호 객실에는 체크인 한 사람이 없습니다.

-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   2    <--- 입력

----------------------------------------------
   체크아웃 작업
----------------------------------------------
체크아웃 할 방 번호를 입력하세요.
방번호 입력 >> 201    <--- 입력
201호 객실의 홍길동님 체크아웃을 완료하였습니다.

-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   3    <--- 입력


----------------------------------------------
      현재 객실 상태
----------------------------------------------
방 번호    방 종류    투숙객 이름
----------------------------------------------
201    싱글룸      -   
202    싱글룸      -   
203    싱글룸      -   
204    싱글룸      -   
205    싱글룸      -   
206    싱글룸      -   
207    싱글룸      -   
208    싱글룸      -   
209    싱글룸      -   
301    더블룸      -   
302    더블룸      -   
303    더블룸      -   
304    더블룸      -   
305    더블룸      -   
306    더블룸      -   
307    더블룸      -   
308    더블룸      -   
309    더블룸      -   
401   스위트룸     -   
402   스위트룸     -   
403   스위트룸     -   
404   스위트룸     -   
405   스위트룸     -   
406   스위트룸     -   
407   스위트룸     -   
408   스위트룸     -   
409   스위트룸     -   
----------------------------------------------


-----------------------------------------------------------
어떤 업무를 하시겠습니까?
1. 체크인    2. 체크아웃    3. 객실상태    4. 업무종료
-----------------------------------------------------------
선택>>   4    <--- 입력

*********************************************
       호텔문을 닫았습니다.
*********************************************
 */

/*
public class HotelTest {

	private Scanner scan = new Scanner(System.in);
	private HashMap<Integer, Room> Hotel = new HashMap<>();

	public static void main(String[] args) {
		new HotelTest().HotelMenu();
	}

	public void HotelMenu() {
		while (true) {
			System.out.println();
			System.out.println("┌=========================================┐");
			System.out.println("│	 호텔문을 열었습니다. 			  │");
			System.out.println("│	 어서오십시오. 	          	  │");
			System.out.println("├-----------------------------------------┤");
			System.out.println("│	 				  │");
			System.out.println("│	  어떤 업무를 진행하시겠습니까?           	  │");
			System.out.println("│	 				  │");
			System.out.println("├-----------------------------------------┤");
			System.out.println("│	 				  │");
			System.out.println("│	  1.체크인           		  │");
			System.out.println("│	  2.체크아웃   		      	  │");
			System.out.println("│	  3.객실상태         		  │");
			System.out.println("│	  4.프로그램 종료      	     	  │");
			System.out.println("│	 				  │");
			System.out.println("└=========================================┘");
			System.out.print("번호 입력 >> ");

			int choice = scan.nextInt();
			scan.nextLine(); // 엔터키 제거

			switch (choice) {
			case 1:
				HotelCheckIn();
				break;
			case 2:
				HotelCheckOut();
				break;
			case 3:
				HotelAll();
				break;
			case 4:
				System.out.println("┌=========================================┐");
				System.out.println("│	 호텔문을 닫았습니다. 	          	  │");
				System.out.println("│	 안녕히가세요. 	          	  │");
				System.out.println("└=========================================┘");
				return;
			default:
				System.out.println("잘못된 입력입니다. 다시 입력해주세요.");

			}
		}
		
	}

	public HotelTest() {
		for (int i = 201; i <= 209; i++) {
			Hotel.put(i, new Room(i, "싱글룸", null));
		}
		for (int i = 301; i <= 309; i++) {
			Hotel.put(i, new Room(i, "더블룸", null));
		}
		for (int i = 401; i <= 409; i++) {
			Hotel.put(i, new Room(i, "스위트룸", null));
		}
	}

	public void HotelCheckIn() {
			System.out.println("┌-----------------------------------------┐");
			System.out.println("│	        체크인 작업          	  │");
			System.out.println("├-----------------------------------------┤");
			System.out.println("│	 				  │");
			System.out.println("│	 * 201 ~ 209 : 싱글룸		  │");
			System.out.println("│	 * 301 ~ 309 : 더블룸		  │");
			System.out.println("│	 * 401 ~ 409 : 스위트룸		  │");
			System.out.println("│	 				  │");
			System.out.println("└-----------------------------------------┘");
			System.out.print("체크인 할 방 번호를 입력해주세요. >> ");
			int roomNum = scan.nextInt();
			


			if (!Hotel.containsKey(roomNum)) {
				System.out.println(roomNum + "호 객실은 존재하지 않습니다.");
				return;
			}

			if (Hotel.get(roomNum).getName() != null) {
				System.out.println(roomNum + "호 객실은 이미 손님이 있습니다.");
				return;
			}

			System.out.print("예약 고객님의 이름을 입력해주세요. >> ");
			String name = scan.next();
			Hotel.get(roomNum).setName(name);
			System.out.println("어서오세요 " + name + "님의 " + roomNum + "호 체크인이 정상적으로 완료되었습니다.");
		
	}

	public void HotelCheckOut() {
		
		
			System.out.println("┌-----------------------------------------┐");
			System.out.println("│	        체크아웃 작업          	  │");
			System.out.println("├-----------------------------------------┤");
			System.out.println("│	 				  │");
			System.out.println("│	 * 201 ~ 209 : 싱글룸		  │");
			System.out.println("│	 * 301 ~ 309 : 더블룸		  │");
			System.out.println("│	 * 401 ~ 409 : 스위트룸		  │");
			System.out.println("│	 				  │");
			System.out.println("└-----------------------------------------┘");
			System.out.print("체크아웃 할 방 번호 입력해주세요. >> ");
			int roomNum = scan.nextInt();


			if (!Hotel.containsKey(roomNum)) {
				System.out.println(roomNum + "호 객실은 존재하지 않습니다.");
				return;
			}

			if (Hotel.get(roomNum).getName() == null) {
				System.out.println(roomNum + "호 객실에는 체크인 한 손님이 없습니다.");
				return;
			}
			
			System.out.println(roomNum + "호 객실의 " + Hotel.get(roomNum).getName() + "님 체크아웃을 완료하였습니다.\n이용해주셔서 감사합니다.");
			Hotel.get(roomNum).setName(null);

		

	}

	public void HotelAll() {
		
        System.out.println("┌--------------------------------------------┐");
        System.out.println("│      현재 객실 상태			     │");
        System.out.println("├--------------------------------------------┤");
        System.out.println("│방 번호    방 종류    	투숙객 이름	     	     │");
        System.out.println("├--------------------------------------------┤");

        List<Integer> roomNumbers = new ArrayList<>(Hotel.keySet());
        Collections.sort(roomNumbers);
        for (int roomNumber : roomNumbers) {
            Room room = Hotel.get(roomNumber);
            System.out.println("│"+room.getRoomNum() + "      " + room.getRoom() + "		" 
            		+ (room.getName() == null ? "-" : room.getName())+"	    	     │");
            System.out.println("└--------------------------------------------┘");
        }

	}

}

class Room {
	private int RoomNum;
	private String Room;
	private String name;

	public int getRoomNum() {
		return RoomNum;
	}

	public void setRoomNum(int roomNum) {
		RoomNum = roomNum;
	}

	public String getRoom() {
		return Room;
	}

	public void setRoom(String room) {
		Room = room;
	}

	public String getName() {
		return name;
	}

	public void setName(String name) {
		this.name = name;
	}

	public Room(int roomNum, String room, String name) {
		super();
		RoomNum = roomNum;
		Room = room;
		this.name = name;
	}
}
*/
